In [1]:
import pandas as pd

import warnings
warnings.filterwarnings("ignore")

In [2]:
# Leer el archivo CSV de Productos en un DataFrame
productos_df = pd.read_csv("../data/productos.csv")

# Leer el archivo CSV de Categorías en un DataFrame
categorias_df = pd.read_csv("../data/categorias.csv")

# Leer el archivo CSV de Clientes en un DataFrame
clientes_df = pd.read_csv("../data/clientes.csv")

# Leer el archivo CSV de Pedidos en un DataFrame
pedidos_df = pd.read_csv("../data/pedidos.csv")

In [3]:
dfs = [productos_df, categorias_df, clientes_df, pedidos_df]

[display(e) for e in dfs]

   ProductoID      Nombre  Precio  CategoriaID
0           1    Portátil    1000            1
1           2  Smartphone     600            1
2           3   Televisor     800            2
3           4   Impresora     150            3
4           5      Tablet     400            1

   CategoriaID    NombreCategoria
0            1        Electrónica
1            2  Electrodomésticos
2            3            Oficina

   ClienteID  Nombre               Email
0        101     Ana     ana@example.com
1        102  Carlos  carlos@example.com
2        103   Maria   maria@example.com
3        104    Luis    luis@example.com
4        105   Sofía   sofia@example.com
5        106    Juan    juan@example.com
6        107   Laura   laura@example.com
7        108   Pedro   pedro@example.com

   PedidoID  ClienteID  ProductoID  Cantidad
0         1        101           1         2
1         2        102           2         1
2         3        103           3         1
3         4        104           4         3
4         5        105           5         2
5         6        106           1         1
6         7        101           4         2
7         8        108           3         2

[None, None, None, None]

### Aunque tengo las cuatro tablas principales, es necesario generar la tabla intermedia entre Pedidos y Productos

In [4]:
tabla_intermedia = pedidos_df[["PedidoID", "ProductoID"]]
tabla_intermedia

   PedidoID  ProductoID
0         1           1
1         2           2
2         3           3
3         4           4
4         5           5
5         6           1
6         7           4
7         8           3

### Ahora hay que asegurarse de que las columnas y sus nombres coincidan con los de SQL

In [6]:
productos_df.columns

Index(['ProductoID', 'Nombre', 'Precio', 'CategoriaID'], dtype='object')

In [ ]:
#productos_df = productos_df.rename(columns={"CategoriaID": "categorias_CategoriaID"})

In [ ]:
#productos_df.columns

In [7]:
pedidos_df.columns

Index(['PedidoID', 'ClienteID', 'ProductoID', 'Cantidad'], dtype='object')

In [8]:
pedidos_df = pedidos_df[['PedidoID', 'Cantidad', "ClienteID"]]

In [9]:
pedidos_df = pedidos_df.rename(columns={"ClienteID": "Clientes_ClienteID"})

In [10]:
pedidos_df.columns

Index(['PedidoID', 'Cantidad', 'Clientes_ClienteID'], dtype='object')

In [11]:
clientes_df.columns

Index(['ClienteID', 'Nombre', 'Email'], dtype='object')

In [12]:
categorias_df.columns

Index(['CategoriaID', 'NombreCategoria'], dtype='object')

In [13]:
tabla_intermedia.columns

Index(['PedidoID', 'ProductoID'], dtype='object')

In [14]:
tabla_intermedia = tabla_intermedia.rename(columns={"PedidoID": "Pedidos_PedidoID",
                                                   "ProductoID": "Productos_ProductoID"})

In [15]:
[display(e) for e in [productos_df, categorias_df, clientes_df, pedidos_df, tabla_intermedia]]

   ProductoID      Nombre  Precio  CategoriaID
0           1    Portátil    1000            1
1           2  Smartphone     600            1
2           3   Televisor     800            2
3           4   Impresora     150            3
4           5      Tablet     400            1

   CategoriaID    NombreCategoria
0            1        Electrónica
1            2  Electrodomésticos
2            3            Oficina

   ClienteID  Nombre               Email
0        101     Ana     ana@example.com
1        102  Carlos  carlos@example.com
2        103   Maria   maria@example.com
3        104    Luis    luis@example.com
4        105   Sofía   sofia@example.com
5        106    Juan    juan@example.com
6        107   Laura   laura@example.com
7        108   Pedro   pedro@example.com

   PedidoID  Cantidad  Clientes_ClienteID
0         1         2                 101
1         2         1                 102
2         3         1                 103
3         4         3                 104
4         5         2                 105
5         6         1                 106
6         7         2                 101
7         8         2                 108

   Pedidos_PedidoID  Productos_ProductoID
0                 1                     1
1                 2                     2
2                 3                     3
3                 4                     4
4                 5                     5
5                 6                     1
6                 7                     4
7                 8                     3

[None, None, None, None, None]

### Ya tenemos las tablas. Exportamos a MySQL usando sqlalchemy.

In [16]:
from sqlalchemy import create_engine

from password import password

In [17]:
str_conn = f'mysql+pymysql://root:{password}@localhost:3306/repasosql'
cursor = create_engine(str_conn)

In [18]:
clientes_df.to_sql('clientes',con=cursor, if_exists='append', index=False)
categorias_df.to_sql('categorias',con=cursor, if_exists='append', index=False)
productos_df.to_sql('productos',con=cursor, if_exists='append', index=False)
pedidos_df.to_sql('pedidos',con=cursor, if_exists='append', index=False)
tabla_intermedia.to_sql('pedidos_has_productos',con=cursor, if_exists='append', index=False)

8